src/InformationRegisters/SocialNetworks_Messages.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>SocialNetworks_Messages</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>CollaborationMessageId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Incoming</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Outgoing</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Text</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>SocialConversation</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SocialNetworks_Conversations</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SocialUser</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SocialNetworks_Users</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ChatId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>MessageId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/FL_Messages.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>FL_Messages</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AppId</Name>
					<Comment>Identifier of the application that produced the message.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContentEncoding</Name>
					<Comment>Message content encoding.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContentType</Name>
					<Comment>Message content type.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CorrelationId</Name>
					<Comment>Message correlated to this one.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EventSource</Name>
					<Comment>Provides access to the event source object name.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Operation</Name>
					<Comment>The type of change experienced.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.FL_Operations</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReplyTo</Name>
					<Comment>Resource name other apps should send the response to.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Routed</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Timestamp</Name>
					<Comment>Timestamp of the moment when message was created.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UserId</Name>
					<Comment>User id.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Context</Name>
					<Comment>Serialized invocation data into XML. </Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Filter</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NamespaceURI</Name>
							<Comment>URI of the name space, to which the XML type belongs.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PrimaryKey</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>TypeName</Name>
							<Comment>A representation XML data type by XML type name.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>XMLValue</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>AppEndpoints</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Endpoint</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Channels</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Exchange</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Exchanges</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Job</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Jobs</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Exchanges</Name>
					<Comment>List of exchanges.</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Exchange</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Exchanges</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Job</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.FL_Jobs</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>SessionContext</Name>
					<Comment>Provides access to the runtime session context.</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>MetadataObject</Name>
							<Comment>Provides access to the metadata object name.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>80</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Session</Name>
							<Comment>Semi-permanent interactive information interchange.</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ValueStorage</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/SocialNetworks_ExchangeServer/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// This file is part of FoxyLink.
// Copyright © 2018 Petro Bazeliuk.
// 
// This program is free software: you can redistribute it and/or modify 
// it under the terms of the GNU Affero General Public License as 
// published by the Free Software Foundation, either version 3 of the License,
// or (at your option) any later version.
//
// This program is distributed in the hope that it will be useful, 
// but WITHOUT ANY WARRANTY; without even the implied warranty of 
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the 
// GNU Affero General Public License for more details.
//
// You should have received a copy of the GNU Affero General Public License 
// along with this program. If not, see <http://www.gnu.org/licenses/agpl-3.0>.
//
////////////////////////////////////////////////////////////////////////////////

#Region ProgramInterface

// Returns registered the exchange server in the current infobase.
// 
// Returns:
//  ScheduledJob - job server.
//
Function ExchangeServer() Export

    ExchangeServer = FL_JobServer.ScheduledJob(
        Metadata.ScheduledJobs.SocialNetworks_ExchangeServer);
    Return ExchangeServer;

EndFunction // ExchangeServer()

#EndRegion // ProgramInterface

#Region ServiceInterface

// Default ExchangeServer action.
// 
Procedure ExchangeServerAction() Export
    
    LastDate = GetLastDate();
    
    Filter = New CollaborationSystemConversationsFilter;
    Filter.StartDate = LastDate;
    Filter.SortDirection = SortDirection.Asc;
    Filter.CurrentUserIsMember = False;
    
    CollaborationConversations = DataProcessors.FL_CollaborationSystem
        .CollaborationSystemConversations(Filter);    
    For Each Conversation In CollaborationConversations Do
        
        SocialConversation = Catalogs.SocialNetworks_Conversations
            .SocialNetworkConversationByConversationId(
                String(Conversation.ID));
        
        If SocialConversation = Undefined Then
            Continue;
        EndIf;
        
        ProcessCollaborationMessages(SocialConversation, Conversation, 
            LastDate);
        
    EndDo;
    
EndProcedure // ExchangeServerAction()

// Sets a last processed message date for this database.
//
// Parameters:
//  LastDate - Date - the last processed message date for this database. 
//
Procedure SetLastDate(LastDate) Export
    
    Constants.SocialNetworks_LastDate.Set(LastDate);
    
EndProcedure // SetLastDate()

// Returns the last processed message date for this database.
//
// Returns:
//  Date - the last processed message date for this database.
//
Function GetLastDate() Export
    
    SetPrivilegedMode(True);
    Return Constants.SocialNetworks_LastDate.Get();
    
EndFunction // GetLastDate() 

#EndRegion // ServiceInterface

#Region ServiceProceduresAndFunctions

// Only for internal use.
//
Procedure ProcessCollaborationMessages(SocialConversation, Conversation, 
    LastDate)

    MessagePointer = FL_CommonUse.ObjectAttributeValue(SocialConversation, 
        "MessagePointer");
    
    Filter = New CollaborationSystemMessagesFilter;
    Filter.Conversation = Conversation.ID;
    Filter.SortDirection = SortDirection.Asc;
    If ValueIsFilled(MessagePointer) Then
        Filter.After = New CollaborationSystemMessageID(
            MessagePointer);   
    EndIf;
        
    CollaborationMessages = DataProcessors.FL_CollaborationSystem
        .CollaborationSystemMessages(Filter);
    If CollaborationMessages.Count() = 0 Then
        Return;
    EndIf;
    
    ValueTable = InformationRegisters.SocialNetworks_Messages
        .NewMessageMatchesValueTable();
    For Each CollaborationMessage In CollaborationMessages Do
        NewRow = ValueTable.Add();
        NewRow.SocialConversation = SocialConversation;
        NewRow.CollaborationMessageId = String(CollaborationMessage.ID);
        NewRow.Date = CollaborationMessage.Date;
    EndDo; 
    
    Query = New Query;
    Query.Text = QueryTextMessagesWithoutMatches();
    Query.SetParameter("ValueTable", ValueTable);
    QueryResult = Query.Execute();
    If NOT QueryResult.IsEmpty() Then
        MessagesToSend = QueryResult.Unload();
        SendMessageReplies(SocialConversation, CollaborationMessages, 
            MessagesToSend);
    EndIf;
    
    LastMessage = CollaborationMessages[CollaborationMessages.UBound()];
    Catalogs.SocialNetworks_Conversations.UpdateMessagePointer(
        SocialConversation, String(LastMessage.ID));
        
EndProcedure // ProcessCollaborationMessages()

// Only for internal use.
//
Procedure SendMessageReplies(SocialConversation, CollaborationMessages, 
    MessagesToSend)
    
    Invocation = Catalogs.FL_Messages.NewInvocation();
    Invocation.EventSource = "SocialNetworks_ExchangeServer.SendMessageReplies";
    Invocation.Operation = Catalogs.FL_Operations.Send;
    
    Exchange = FL_CommonUse.ReferenceByDescription(
        Metadata.Catalogs.FL_Exchanges, "SocialNetworkMessage");
    
    MessagesToSend.Indexes.Add("CollaborationMessageId");
    For Each CollaborationMessage In CollaborationMessages Do
        
        CollaborationMessageId = String(CollaborationMessage.ID);
        SearchResult = MessagesToSend.Find(CollaborationMessageId, 
            "CollaborationMessageId");
        If SearchResult <> Undefined Then
            
            Catalogs.FL_Messages.AddToContext(Invocation.Context, "Ref", 
                SocialConversation, True);
            Catalogs.FL_Messages.AddToContext(Invocation.Context, 
                "CollaborationMessageId", CollaborationMessageId);
            Catalogs.FL_Messages.AddToContext(Invocation.Context, "Date", 
                SearchResult.Date);
            Catalogs.FL_Messages.AddToContext(Invocation.Context, "Text", 
                String(CollaborationMessage.Text));
            Catalogs.FL_Messages.AddToContext(Invocation.Context, "User", 
                String(CollaborationMessage.Author));
                
            Catalogs.FL_Messages.Route(Invocation, Exchange);
            
            Invocation.Context.Clear();
            
        EndIf;
        
    EndDo;
    
EndProcedure // SendMessageReplies()    

// Only for internal use.
//
Function QueryTextMessagesWithoutMatches()
    
    QueryText = "
        |SELECT
        |   ValueTable.SocialConversation AS SocialConversation,
        |   ValueTable.CollaborationMessageId AS CollaborationMessageId,
        |   ValueTable.Date AS Date
        |INTO CollaborationMessages
        |FROM
        |   &ValueTable AS ValueTable
        |INDEX BY
        |   ValueTable.SocialConversation
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |SELECT
        |   CollaborationMessages.SocialConversation AS SocialConversation,
        |   CollaborationMessages.CollaborationMessageId AS CollaborationMessageId,
        |   CollaborationMessages.Date AS Date 
        |FROM
        |   CollaborationMessages AS CollaborationMessages
        |
        |LEFT JOIN InformationRegister.SocialNetworks_Messages AS SocialMessages
        |ON SocialMessages.SocialConversation = CollaborationMessages.SocialConversation 
        |AND SocialMessages.CollaborationMessageId = CollaborationMessages.CollaborationMessageId
        |
        |WHERE
        |   SocialMessages.MessageId IS NULL
        |
        |ORDER BY
        |   Date ASC
        |;
        |
        |////////////////////////////////////////////////////////////////////////////////
        |DROP CollaborationMessages
        |;
        |
        |";
    Return QueryText;
    
EndFunction // QueryMessagesWithoutMatches()

#EndRegion // ServiceProceduresAndFunctions
